app/Controllers/AsistenController.php

SELECT *
FROM `asisten`
---
    public function index()
    {
        $model = new AsistenModel(); //membuat variable model
        $data['asisten'] = $model->findAll();