app/Models/AsistenModel.php

    public function simpan($record)
    {
        $this->save([
            'nim' => $record['nim'],
            'nama' => $record['nama'],
            'kelas_praktikum' => $record['kelas_praktikum'],
            'ipk' => $record['ipk'],
        ]);
---
INSERT INTO `asisten` (`nim`, `nama`, `kelas_praktikum`, `ipk`) VALUES ('215314110', 'DHEA CINDERA BANTALA', 'PEMBELAJARAN MESIN', '4')

    public function perbarui($data)
    {
        $this->save([
            'nim' => $data['nim'],
            'nama' => $data['nama'],
            'kelas_praktikum' => $data['kelas_praktikum'],
            'ipk' => $data['ipk'],
        ]);
---
UPDATE `asisten` SET `nim` = '215314110', `nama` = 'DHEA CINDERA BANTALA', `kelas_praktikum` = 'PEMBELAJARAN MESIN', `ipk` = '4'
WHERE `asisten`.`nim` IN ('215314110')