app/Models/LoginModel.php

SELECT *
FROM `login`
WHERE `username` = 'dhea'
AND `password` = '1234'
 LIMIT 1
---
    public function cek($data)
    {
        return $this->where(['username' => $data['username'], 'password' => $data['password']])->first();